Revit 2027 API
Camera Methods
The Camera type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Transform |  Transforms the camera
Top
See Also
Reference
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace